{"pages":[{"url":"http://pathoflearning.com/blog/thoughts-on-english","text":"English learning guide Think in more explicit way, having more contents, visualize the world, objects, action, more explicit expression. image what is in the room, what are they doing, how do they look, what's the relation between them, how to describe their looks, wearing, smell, so on. Make what you think in brain more specific and tangible. Assemble each piece of content put in a logical fashion. Chinese is in packed and condensed form compared with English. It is not rare that there is word consisted with over 10 letters in English. For the same amount of time of pronunciation it can represent actually 4 words in Chinese. English sentences needs be more dispatched to parts. and use more \"small\" words to link the different concepts.So it is very critical in English to specific what is the host, what is the object and what is the action in between. How to compose a English sentence as native do? Using more noun phrase plays the trick. In one sentence, there is only one predicate verb which indicate the main logic of the sentence. So to link motion concepts, the way is pretty trivial, converting all other verb phrases to noun phase in which way they can be part of sentence as attribute, complement, adverbial clause, etc... Why my English is not improved, because I didn't have my thoughts in brain explicitly expressed. When one develop their own native core code, analogous to computer's binary code, it is built primary in the infant age. The kids observe the world, develop the their understanding of what's going on in the world, and attach these concepts to their \"language\". Thus it is same as watch the cartoon or movies during their time of infant. What I suggest to refresh this process, because we need learn a second language and it needs provide a second chance for learner to go though this process again. In this way, it is not fist language to second language type of transition, instead, the second language will be in the same position of the first language which directly link the native code of learner's brain. Draft-1 : 2015-11-9","title":"Thoughts on English learning","tags":"misc"},{"url":"http://pathoflearning.com/blog/How-to-setup-website-python","text":".input_prompt, .input_area, .output_prompt { display:none !important; } The purpose of this site is to share the experience, guides and pathes of learning. The content in the site is in a concise fashion and will leverage others exisiting work as much as possible. So in the first post, I put a guide for how to set up a static website using Python based Pelican framework and freely host it in Github . This post was all written in ipython notebook or jupyter which are also Python based tools and it is the primary reason for me to choose pelican instead of other static site generators, such as Ruby based Jekyll or Javascript based Hexo , etc. Register an account in Github and and setup a repository called \" yourname .github.io\" (replace yourname with your github username) where we will use to upload the content fo website, see this for detail . Install pelican, follow this guide , create content in markdown language , upload the output you generated to 1 , then done! If you want to change the looks for the site, check out pelican-themes and its Github repository . The current theme for this site is adapted from lazystrap . Want to use ipython notebook in pelican? see Jake VanderPlas' post and checkout source file at Github . Use the settings in his pelicanconf.py file Other tips: Google Analytics, register here DISQUS for comments, register here I used the command \"pelican content\" to generate the output, and I have to move settings in publishconf.py to pelicanconf.py in order to get GOOGLE_ANALYTICS and DISQUS_SITENAME rendered. Make sure to set value for SITEURL, and set RELATIVE_URLS = Ture for testing and False for production. To hide the python code in ipython notebook, just add this css code in the markdown file < style type = \"text/css\" > .input_prompt , .input_area , .output_prompt { display : none !important ; } </ style > This is the minimal guide for setting up a static website using Python. If you have questions, please leave the comments below.","title":"How to setup website with Python","tags":"misc"}]}